import os
import time
print("Добро пожаловать в программе!") #Приветсвие
local_time = 1 #1 сек
time.sleep(local_time) #Программа засыпает на значение local_time сек
def main(a):
    if a == 10:
        print("Текущая директория:", os.getcwd())  # Отображание текущей директории
        print("Что бы вы хотели сделать?")
        print("1.Создать новую папку")
        print("2.Изменить директорию")
        print("3.Создать новый текстовый файл")
        print("4.Переименовать файл")
        print("5.Отобразить все папкки и файлы в текущей директории")
        print("6.Удаление файлов")
        print("7.Удалить директорию")
        print("8.Получить информацию о файле")
        print("9.Закрыть программу")
        print("10.Помощь")
        a = int(input("Номер команды:"))
        main(a)
    if a == 0:
        print("Текущая директория:", os.getcwd())  # Отображание текущей директории
        print("Что бы вы хотели сделать?")
        print("1.Создать новую папку")
        print("2.Изменить директорию")
        print("3.Создать новый текстовый файл")
        print("4.Переименовать файл")
        print("5.Отобразить все папкки и файлы в текущей директории")
        print("6.Удаление файлов")
        print("7.Удалить текущую директорию")
        print("8.Получить информацию о файле")
        print("9.Закрыть программу")
        print("10.Помощь")
        a = int(input("Номер команды:"))
        main(a)
    if a==1:
        print("Как назовем папку?")
        papka = str(input()) #Ввод имени папки
        os.mkdir(papka) #Папка названа
        print("Папка успешно создана")
        a = int(input("Введите следующий номер команды:"))
        main(a)
    elif a==2:
        print("Название директории?")
        dir = str(input()) #Ввод названия
        os.chdir(dir) #Команда записи ввода
        print("Директория успешно изменена на", dir)
        os.getcwd() #Отображение текущей директории
        a = int(input("Введите следующий номер команды:"))
        main(a)
    elif a==3:
        print("Как назовем этот файл?")
        fail = str(input()) #Ввод названия
        text_file = open(fail, "w")
        print("Файл создан!")
        print("Желаете что то записать в этот файл?")
        print("1.Да")
        print("2.Нет,спасибо")
        b = int(input())



        if b==1:
            print("Пишите:")
            zapic = str(input()) #Ввод
            text_file.write(zapic) #Команда записи ввода
            text_file.close() #Закрытие и сохранение
            a = int(input("Введите следующий номер команды:"))
            main(a)
        elif b==2:
            print("Хорошо")
            a = int(input("Введите следующий номер команды:"))
            main(a)
    elif a==4:
        print("Какой файл вы хотите переименовать?")
        s = str(input()) #Ввод названия
        print("Придумайте новое имя файлу")
        d = str(input()) #Ввод названия
        os.rename(s,d) #Команда для переименования
        print("Файл успешно переименован")
        a = int(input("Введите следующий номер команды:"))
        main(a)
    elif a==5:
        print("Все папки и файлы", os.listdir())
        a = int(input("Введите следующий номер команды:"))
        main(a)
    elif a==6:
        print("Как называется файл, который нужно удалить?")
        e = str(input()) #Ввод названия
        os.remove(e)
        a = int(input("Введите следующий номер команды:"))
        main(a)
    elif a==7:
        print("Как называется ваша директория?(папка)")
        f = str(input()) #Ввод названия
        os.rmdir(f) #Команда удаления директории
        print("Директория удалена")
        a = int(input("Введите следующий номер команды:"))
        main(a)
    elif a==8:
        print("Какой файл вы хотите открыть?")
        g = str(input()) #Ввод названия
        os.stat(g) #Открытие
        a = int(input("Введите следующий номер команды:"))
        main(a)
    elif a==9:
        return 0


main(0)



